package jp.ac.tbc_u.typing_game

data class Words(val name: String, val words: Array<Word>) {

    override fun equals(other: Any?): Boolean {
        if (this === other)
            return true
        if (javaClass != other?.javaClass)
            return false

        other as Words

        if (name != other.name)
            return false
        if (!words.contentEquals(other.words))
            return false

        return true
    }

    override fun hashCode(): Int {
        var result = name.hashCode()
        result = 31 * result + words.contentHashCode()
        return result
    }
}

val WORDS_PREFECTURE_NAMES = Words(
    "都道府県名",
    arrayOf(
        Word.of("北海道", "ほ{0}っか{0}いど{0}う"),
        Word.of("青森県", "あ{0}おも{0}りけ{0}ん"),
        Word.of("岩手県", "い{0}わてけ{0}ん"),
        Word.of("宮城県", "み{0}やぎけ{0}ん"),
        Word.of("秋田県", "あ{0}きたけ{0}ん"),
        Word.of("山形県", "や{0}まが{0}たけ{0}ん"),
        Word.of("福島県", "ふ{0}くし{0}まけ{0}ん"),
        Word.of("茨城県", "い{0}ば{0}らきけ{0}ん"),
        Word.of("栃木県", "と{0}ちぎけ{0}ん"),
        Word.of("群馬県", "ぐ{0}んまけ{0}ん"),
        Word.of("埼玉県", "さ{0}いた{0}まけ{0}ん"),
        Word.of("千葉県", "ちばけ{0}ん"),
        Word.of("東京都", "と{0}うきょ{0,2}う{1}と"),
        Word.of("神奈川県", "かなが{0}わけ{0}ん"),
        Word.of("新潟県", "に{0}いが{0}たけ{0}ん"),
        Word.of("富山県", "とや{0}まけ{0}ん"),
        Word.of("石川県", "い{0}しか{0}わけ{0}ん"),
        Word.of("福井県", "ふ{0}くいけ{0}ん"),
        Word.of("山梨県", "や{0}まな{0}しけ{0}ん"),
        Word.of("長野県", "な{0}がのけ{0}ん"),
        Word.of("岐阜県", "ぎふけ{0}ん"),
        Word.of("静岡県", "し{0}ずお{0}かけ{0}ん"),
        Word.of("愛知県", "あ{0}いちけ{0}ん"),
        Word.of("三重県", "みえけ{0}ん"),
        Word.of("滋賀県", "しがけ{0}ん"),
        Word.of("京都府", "きょ{0,2}うとふ"),
        Word.of("大阪府", "お{0}おさ{0}かふ"),
        Word.of("兵庫県", "ひょ{0,2}うごけ{0}ん"),
        Word.of("奈良県", "ならけ{0}ん"),
        Word.of("和歌山県", "わかや{0}まけ{0}ん"),
        Word.of("鳥取県", "と{0}っ{1}と{0}りけ{0}ん"),
        Word.of("島根県", "し{0}まねけ{0}ん"),
        Word.of("岡山県", "お{0}かや{0}まけ{0}ん"),
        Word.of("広島県", "ひ{0}ろし{0}まけ{0}ん"),
        Word.of("山口県", "や{0}まぐ{0}ちけ{0}ん"),
        Word.of("徳島県", "と{0}くし{0}まけ{0}ん"),
        Word.of("香川県", "かが{0}わけ{0}ん"),
        Word.of("愛媛県", "えひ{0}めけ{0}ん"),
        Word.of("高知県", "こ{0}うちけ{0}ん"),
        Word.of("福岡県", "ふ{0}くお{0}かけ{0}ん"),
        Word.of("佐賀県", "さがけ{0}ん"),
        Word.of("長崎県", "な{0}がさ{0}きけ{0}ん"),
        Word.of("熊本県", "く{0}まも{0}とけ{0}ん"),
        Word.of("大分県", "お{0}おい{0}たけ{0}ん"),
        Word.of("宮崎県", "み{0}やざ{0}きけ{0}ん"),
        Word.of("鹿児島県", "かごし{0}まけ{0}ん"),
        Word.of("沖縄県", "お{0}きな{0}わけ{0}ん")
    )
)

val WORDS_HARD_TO_READ_TOCHIGI_PLACE_NAMES = Words(
    "栃木県の難読地名",
    arrayOf(
        Word.of("〈宇都宮市〉鐺山町", "こ{6}てや{0}まま{0}ち"),
        Word.of("〈宇都宮市〉野高谷町", "の{7}ごやま{0}ち"),
        Word.of("〈宇都宮市〉上籠谷町", "か{6}みこ{0}も{0}りやま{0}ち"),
        Word.of("〈宇都宮市〉徳次郎町", "と{6}くじらま{0}ち"),
        Word.of("〈宇都宮市〉立伏町", "りゅ{6,2}うぶ{0}くちょ{0,2}う"),
        Word.of("〈足利市〉県町", "あ{5}が{0}たちょ{0,2}う"),
        Word.of("〈栃木市〉出流町", "い{5}ずるま{0}ち"),
        Word.of("〈栃木市〉都賀町合戦場", "つ{6}がま{0}ちかっ{0}せ{0}んば"),
        Word.of("〈栃木市〉西方町真名子", "に{5}しか{0}たま{0}ちまなご"),
        Word.of("〈佐野市〉葛生", "く{5}ずう"),
        Word.of("〈佐野市〉出流原町", "い{5}ずるは{0}らちょ{0,2}う"),
        Word.of("〈日光市〉文挟町", "ふ{6}ば{0}さ{0}みま{0}ち"),
        Word.of("〈日光市〉小来川", "お{6}こ{0}ろが{0}わ"),
        Word.of("〈小山市〉神鳥谷", "ひ{5}と{0}と{0}の{2}や"),
        Word.of("〈真岡市〉道祖土", "さ{6}やど"),
        Word.of("〈真岡市〉下籠谷", "し{5}もこ{0}も{0}りや"),
        Word.of("〈上三川町〉東汗", "ひ{6}が{0}しふ{0}ざ{0}か{0}し"),
        Word.of("〈上三川町〉西汗", "に{6}しふ{0}ざ{0}か{0}し"),
        Word.of("〈芳賀町〉祖母井", "う{5}ば{0}が{2}い"),
        Word.of("〈塩谷町〉玉生", "た{5}まにゅ{0,2}う"),
        Word.of("〈塩谷町〉船生", "ふ{6}にゅ{0,2}う"),
        Word.of("〈高根沢町〉宝積寺", "ほ{6}うしゃ{0,2}くじ")
    )
)

val WORDS_NIJISANJI_2018_MEMBER_NAMES = Words(
    "にじさんじ (2018年)",
    arrayOf(
        Word.of("月ノ美兎", "つ{0}きのみと"),
        Word.of("樋口楓", "ひぐ{0}ちか{0}え{0}で"),
        Word.of("静凛", "し{0}ず{0}かり{0}ん"),
        Word.of("える", "える"),
        Word.of("渋谷ハジメ", "し{0}ぶやはじめ"),
        Word.of("モイラ", "もいら"),
        Word.of("宇志海いちご", "うしみいちご"),
        Word.of("家長むぎ", "い{0}えな{0}がむぎ"),
        Word.of("夕陽リリ", "ゆ{0}うひりり"),
        Word.of("物述有栖", "も{0}のの{0}べあ{0}りす"),
        Word.of("文野環", "ふ{0}みのた{0}ま{0}き"),
        Word.of("伏見ガク", "ふ{0}しみがく"),
        Word.of("ギルザレンⅢ世", "ぎるざれんさ{0}んせ{0}い"),
        Word.of("剣持刀也", "け{0}んも{0}ちと{0}うや"),
        Word.of("森中花咲", "も{0}りな{0}かかざ{0}き"),
        Word.of("叶", "か{0}な{0}え"),
        Word.of("赤羽葉子", "あ{0}かば{0}ねよ{0}うこ"),
        Word.of("笹木咲", "さ{0}さきさ{0}く"),
        Word.of("本間ひまわり", "ほ{0}んまひまわり"),
        Word.of("魔界ノりりむ", "まか{0}いのりりむ"),
        Word.of("葛葉", "く{0}ずは"),
        Word.of("椎名唯華", "し{0}いなゆ{0}いか"),
        Word.of("ドーラ", "どーら"),
        Word.of("轟京子", "と{0}ど{0}ろ{0}ききょ{0,2}うこ"),
        Word.of("シスター・クレア", "しすたー・くれあ"),
        Word.of("花畑チャイカ", "は{0}なば{0}た{0}けちゃ{0,2}いか"),
        Word.of("社築", "や{0}し{0}ろき{0}ず{0}く"),
        Word.of("鈴木勝", "す{0}ずきま{0}さ{0}る"),
        Word.of("緑仙", "りゅ{0,2}ーしぇ{0,2}ん"),
        Word.of("卯月コウ", "うづ{0}きこう"),
        Word.of("神田笑一", "か{0}んだしょ{0,2}うい{0}ち"),
        Word.of("飛鳥ひな", "あ{0}す{0}か{2}ひな"),
        Word.of("春崎エアル", "は{0}るさ{0}きえある"),
        Word.of("雨森小夜", "あ{0}めも{0}りさよ"),
        Word.of("鷹宮リオン", "た{0}かみ{0}やりおん"),
        Word.of("舞元啓介", "ま{0}いも{0}とけ{0}いす{0}け"),
        Word.of("竜胆尊", "り{0}んど{0}うみ{0}こ{0}と"),
        Word.of("でびでび・でびる", "でびでび・でびる"),
        Word.of("桜凛月", "さ{0}く{0}らりつ{0}き"),
        Word.of("町田ちま", "ま{0}ちたちま"),
        Word.of("ジョー・力一", "じょー・り{0}きい{0}ち"),
        Word.of("ベルモンド・バンデラス", "べるもんど・ばんでらす"),
        Word.of("矢車りね", "やぐ{0}る{0}まりね"),
        Word.of("夢追翔", "ゆ{0}めお{0}いか{0}け{0}る"),
        Word.of("黒井しば", "く{0}ろいしば")
    )
)

val WORDS_NIJISANJI_2019_MEMBER_NAMES = Words(
    "にじさんじ (2019年)",
    arrayOf(
        Word.of("夢月ロア", "ゆづ{0}きろあ"),
        Word.of("小野町春香", "おのま{0}ちは{0}るか"),
        Word.of("語部紡", "か{0}た{0}りべつ{0}む{0}ぐ"),
        Word.of("戌亥とこ", "い{0}ぬいとこ"),
        Word.of("アンジュ・カトリーナ", "あんじゅ{2,2}・かとりーな"),
        Word.of("リゼ・ヘルエスタ", "りぜ・へるえすた"),
        Word.of("三枝明那", "さ{0}え{0}ぐ{0}さ{2}あ{0}きな"),
        Word.of("愛園愛美", "あ{0}いぞ{0}のま{0}なみ"),
        Word.of("雪城眞尋", "ゆ{0}きし{0}ろまひ{0}ろ"),
        Word.of("エクス・アルビオ", "えくす・あるびお"),
        Word.of("レヴィ・エリファ", "れゔぃ{2,2}・えりふぁ{0,2}"),
        Word.of("葉山舞鈴", "はや{0}ままり{0}ん"),
        Word.of("ニュイ・ソシエール", "にゅ{2,2}い・そしえーる"),
        Word.of("葉加瀬冬雪", "はかせふゆ{0}き"),
        Word.of("加賀美ハヤト", "かがみはやと"),
        Word.of("夜見れな", "よ{0}るみれな"),
        Word.of("アルス・アルマル", "あるす・あるまる"),
        Word.of("天宮こころ", "あ{0}まみ{0}やこころ"),
        Word.of("エリー・コニファー", "えりー・こにふぁ{2,2}ー"),
        Word.of("ラトナ・プティ", "らとな・ぷてぃ{2,2}"),
        Word.of("早瀬走", "は{0}やせそ{0}う"),
        Word.of("健屋花那", "す{0}こやかな"),
        Word.of("シェリン・バーガンディ", "しぇ{2,2}りん・ばーがんでぃ{2,2}"),
        Word.of("フミ", "ふみ"),
        Word.of("星川サラ", "ほ{0}しか{0}わさら"),
        Word.of("山神カルタ", "や{0}まが{0}みかるた"),
        Word.of("えま★おうがすと", "えま{2}おうがすと"),
        Word.of("ルイス・キャミー", "るいす・きゃ{2,2}みー"),
        Word.of("魔使マオ", "まつ{0}か{0}いまお"),
        Word.of("不破湊", "ふわみ{0}な{0}と"),
        Word.of("白雪巴", "し{0}らゆ{0}きと{0}も{0}え"),
        Word.of("グウェル・オス・ガール", "ぐうぇ{2,2}る・おす・がーる"),
        Word.of("ましろ爻", "ましろめ{0}め"),
        Word.of("奈羅花", "ならか"),
        Word.of("来栖夏芽", "く{0}るすな{0}つめ")
    )
)

val WORDS_NIJISANJI_2020_MEMBER_NAMES = Words(
    "にじさんじ (2020年)",
    arrayOf(
        Word.of("フレン・E・ルスタリオ", "ふれん・E・るすたりお"),
        Word.of("イブラヒム", "いぶらひむ"),
        Word.of("長尾景", "な{0}がおけ{0}い"),
        Word.of("弦月藤士郎", "げ{0}んづ{0}きと{0}うじろ{0}う"),
        Word.of("甲斐田晴", "かいだは{0}る"),
        Word.of("空星きらめ", "そ{0}らほ{0}しきらめ"),
        Word.of("周央サンゴ", "すお{0}うさんご"),
        Word.of("東堂コハク", "と{0}うど{0}うこはく"),
        Word.of("北小路ヒスイ", "き{0}たこ{0}うじひすい"),
        Word.of("西園チグサ", "に{0}しぞ{0}のちぐさ")
    )
)

val WORDS_NIJISANJI_2021_MEMBER_NAMES = Words(
    "にじさんじ (2021年)",
    arrayOf(
        Word.of("ローレン・イロアス", "ろーれん・いろあす"),
        Word.of("レオス・ヴィンセント", "れおす・ゔぃんせんと"),
        Word.of("オリバー・エバンス", "おりばー・えばんす"),
        Word.of("レイン・パターソン", "れいん・ぱたーそん")
    )
)

val WORDS_NIJISANJI_2022_MEMBER_NAMES = Words(
    "にじさんじ (2022年)",
    arrayOf(
        Word.of("天ヶ瀬むゆ", "あ{0}まがせむゆ"),
        Word.of("先斗寧", "ぽ{0}んとね{0}い"),
        Word.of("海妹四葉", "う{0}みせよ{0}つは"),
        Word.of("壱百満天原サロメ", "ひゃ{0,2}く{2}ま{0}んて{0}んば{0}らさろめ"),
        Word.of("風楽奏斗", "ふ{0}うらか{0}なと"),
        Word.of("渡会雲雀", "わ{0}たら{0}いひ{0}ば{0}り{2}"),
        Word.of("四季凪アキラ", "しきな{0}ぎあきら"),
        Word.of("セラフ・ダズルガーデン", "せらふ・だずるがーでん")
    )
)

val WORDS_NIJISANJI_2023_MEMBER_NAMES = Words(
    "にじさんじ (2023年)",
    arrayOf(
        Word.of("小清水透", "こしみ{0}ずと{0}お{0}る"),
        Word.of("獅子堂あかり", "ししど{0}うあかり"),
        Word.of("鏑木ろこ", "か{0}ぶ{0}らきろこ"),
        Word.of("五十嵐梨花", "い{0}が{0}ら{0}し{3}りか"),
        Word.of("石神のぞみ", "い{0}しが{0}みのぞみ"),
        Word.of("ソフィア・ヴァレンタイン", "そふぃ{2,2}あ・ゔぁ{2,2}れんたいん"),
        Word.of("倉持めると", "く{0}らも{0}ちめると"),
        Word.of("佐伯イッテツ", "さ{0}い{0}き{2}いってつ"),
        Word.of("赤城ウェン", "あ{0}かぎうぇ{2,2}ん"),
        Word.of("宇佐美リト", "うさみりと"),
        Word.of("緋八マナ", "ひば{0}ちまな"),
        Word.of("星導ショウ", "ほ{0}し{0}る{0}べ{2}しょ{2,2}う"),
        Word.of("叢雲カゲツ", "む{0}らく{0}もかげつ"),
        Word.of("小柳ロウ", "こや{0}な{0}ぎろう"),
        Word.of("伊波ライ", "いな{0}みらい"),
        Word.of("立伝都々", "た{0}ちつ{0}てとと"),
        Word.of("栞葉るり", "し{0}お{0}りはるり"),
    )
)

val WORDS_NIJISANJI_2024_MEMBER_NAMES = Words(
    "にじさんじ (2024年)",
    arrayOf(
        Word.of("北見遊征", "き{0}たみゆ{0}うせ{0}い"),
        Word.of("魁星", "か{0}いせ{0}い"),
        Word.of("榊ネス", "さ{0}か{0}きねす"),
        Word.of("司賀りこ", "しがりこ"),
        Word.of("珠乃井ナナ", "た{0}まのいなな"),
        Word.of("綺沙良", "きさら"),
        Word.of("梢桃音", "こ{0}ず{0}えもね"),
        Word.of("ルンルン", "るんるん"),
        Word.of("七瀬すず菜", "な{0}なせすずな"),
        Word.of("早乙女ベリー", "さお{0}とめべりー"),
        Word.of("雲母たまこ", "き{0}ら{0}ら{2}たまこ"),
        Word.of("酒寄颯馬", "さ{0}かよ{0}りそ{0}うま"),
        Word.of("渚トラウト", "な{0}ぎ{0}さとらうと")
    )
)

val WORDS_NIJISANJI_2025_MEMBER_NAMES = Words(
    "にじさんじ (2025年)",
    arrayOf(
        Word.of("一橋綾人", "ひ{0}と{0}つば{0}しあ{0}やと"),
        Word.of("五木左京", "い{0}つきさきょ{0,2}う")
    )
)

val WORDS_HOLOLIVE_MEMBER_NAMES = Words(
    "ホロライブ",
    arrayOf(
        Word.of(
            "ときのそら",
            "ときのそら"
        ),
        Word.of(
            "ロボ子さん",
            "ろぼこさん"
        ),
        Word.of(
            "AZKi",
            "azki"
        ),
        Word.of(
            "さくらみこ",
            "さくらみこ"
        ),
        Word.of(
            "星街すいせい",
            "ほ{0}しま{0}ちすいせい"
        ),
        Word.of(
            "アキ・ローゼンタール",
            "あき・ろーぜんたーる"
        ),
        Word.of(
            "赤井はあと",
            "あ{0}かいはあと"
        ),
        Word.of(
            "白上フブキ",
            "し{0}らか{0}みふぶき"
        ),
        Word.of(
            "夏色まつり",
            "な{0}つい{0}ろまつり"
        ),
        Word.of(
            "百鬼あやめ",
            "な{0}き{0}り{2}あやめ"
        ),
        Word.of(
            "癒月ちょこ",
            "ゆづ{0}きちょこ"
        ),
        Word.of(
            "大空スバル",
            "お{0}おぞ{0}らすばる"
        ),
        Word.of(
            "大神ミオ",
            "お{0}おか{0}みみお"
        ),
        Word.of(
            "猫又おかゆ",
            "ね{0}こま{0}たおかゆ"
        ),
        Word.of(
            "戌神ころね",
            "い{0}ぬが{0}みころね"
        ),
        Word.of(
            "兎田ぺこら",
            "う{0}さだぺこら"
        ),
        Word.of(
            "不知火フレア",
            "し{0}ら{0}ぬ{0}い{3}ふれあ"
        ),
        Word.of(
            "白銀ノエル",
            "し{0}ろが{0}ねのえる"
        ),
        Word.of(
            "宝鐘マリン",
            "ほ{0}うしょ{0,2}うまりん"
        ),
        Word.of(
            "天音かなた",
            "あ{0}まねかなた"
        ),
        Word.of(
            "角巻わため",
            "つ{0}のま{0}きわため"
        ),
        Word.of(
            "常闇トワ",
            "と{0}こや{0}みとわ"
        ),
        Word.of(
            "姫森ルーナ",
            "ひ{0}めも{0}りるーな"
        ),
        Word.of(
            "雪花ラミィ",
            "ゆ{0}きは{0}ならみぃ"
        ),
        Word.of(
            "桃鈴ねね",
            "も{0}もす{0}ずねね"
        ),
        Word.of(
            "獅白ぼたん",
            "しし{0}ろぼたん"
        ),
        Word.of(
            "尾丸ポルカ",
            "おま{0}るぽるか"
        ),
        Word.of(
            "ラプラス・ダークネス",
            "や{4}まだ{5}"
        ),
        Word.of(
            "鷹嶺ルイ",
            "た{0}かねるい"
        ),
        Word.of(
            "風真いろは",
            "か{0}ざまいろは"
        ),
        Word.of(
            "博衣こより",
            "は{0}くいこより"
        ),
        Word.of(
            "火威青",
            "ひお{0}ど{0}しあ{0}お"
        ),
        Word.of(
            "音乃瀬奏",
            "お{0}とのせか{0}な{0}で"
        ),
        Word.of(
            "一条莉々華",
            "い{0}ちじょ{0,2}うりりか"
        ),
        Word.of(
            "儒烏風亭らでん",
            "じゅ{1,2}うふ{0}うて{0}いらでん"
        ),
        Word.of(
            "轟はじめ",
            "と{0}ど{0}ろ{0}きはじめ"
        ),
        Word.of(
            "響咲リオナ",
            "いさ{0}きりおな"
        ),
        Word.of(
            "虎金妃笑虎",
            "こが{0}ねいにこ"
        ),
        Word.of(
            "水宮枢",
            "み{0}ずみ{0}やす{0}う"
        ),
        Word.of(
            "輪堂千速",
            "り{0}んど{0}うちは{0}や"
        ),
        Word.of(
            "綺々羅々ヴィヴィ",
            "ききららゔぃ{2,2}ゔぃ{2,2}"
        ),

        Word.of(
            "るしあと一生一緒エンゲージリング",
            "み{4}け{4}ね{4}こ{4}"
        ),
    )
)

val WORD_MAPPING = arrayOf(
    WORDS_PREFECTURE_NAMES,
    WORDS_HARD_TO_READ_TOCHIGI_PLACE_NAMES,
    // WORDS_NIJISANJI_2018_MEMBER_NAMES,
    // WORDS_NIJISANJI_2019_MEMBER_NAMES,
    Words(
        "にじさんじ (2018年～2019年)",
        WORDS_NIJISANJI_2018_MEMBER_NAMES.words + WORDS_NIJISANJI_2019_MEMBER_NAMES.words
    ),
    // WORDS_NIJISANJI_2020_MEMBER_NAMES,
    // WORDS_NIJISANJI_2021_MEMBER_NAMES,
    // WORDS_NIJISANJI_2022_MEMBER_NAMES,
    /*
    Words(
        "にじさんじ (2020年～2022年)",
        WORDS_NIJISANJI_2020_MEMBER_NAMES.words + WORDS_NIJISANJI_2021_MEMBER_NAMES.words + WORDS_NIJISANJI_2022_MEMBER_NAMES.words
    ),
    */
    // WORDS_NIJISANJI_2023_MEMBER_NAMES,
    // WORDS_NIJISANJI_2024_MEMBER_NAMES,
    // WORDS_NIJISANJI_2025_MEMBER_NAMES,
    /*
    Words(
        "にじさんじ (2023年～2025年)",
        WORDS_NIJISANJI_2023_MEMBER_NAMES.words + WORDS_NIJISANJI_2024_MEMBER_NAMES.words + WORDS_NIJISANJI_2025_MEMBER_NAMES.words
    ),
    */
    Words(
        "にじさんじ (2020年～2025年)",
        WORDS_NIJISANJI_2020_MEMBER_NAMES.words + WORDS_NIJISANJI_2021_MEMBER_NAMES.words + WORDS_NIJISANJI_2022_MEMBER_NAMES.words + WORDS_NIJISANJI_2023_MEMBER_NAMES.words + WORDS_NIJISANJI_2024_MEMBER_NAMES.words + WORDS_NIJISANJI_2025_MEMBER_NAMES.words
    ),
    WORDS_HOLOLIVE_MEMBER_NAMES,
    Words(
        "デバッグ用",
        arrayOf(
            Word.of("群馬県", "ぐ{0}んまけ{0}ん")
        )
    )
).associateBy { it.name }